app/controllers/admin/shoes_controller.rb

SELECT `shoes`.* FROM `shoes`
---
  def index
    @shoes = Shoe.all

SELECT `companies`.* FROM `companies`
---
  def new
    @shoe = Shoe.new
    @categories = Category.active
    @company = Company.all

INSERT INTO `shoes` (`category_id`, `company_id`, `cover_content_type`, `cover_file_name`, `cover_file_size`, `cover_updated_at`, `created_at`, `description`, `name`, `price`, `updated_at`) VALUES (1, 2, 'image/jpeg', 'download.jpg', 7497, '2014-12-06 08:59:40', '2014-12-06 08:59:40', 'asdadas', 'Sandal 2015', 200000.0, '2014-12-06 08:59:40')
---
  def create
    Rails.logger.info "[create shoe from admin], #{params.inspect}"
    @shoe = Shoe.new(shoe_params)

    respond_to do |format|
      if @shoe.save

DELETE FROM `shoes` WHERE `shoes`.`id` = 1
---
  def destroy
    @shoe.destroy

SELECT  `shoes`.* FROM `shoes`  WHERE `shoes`.`id` = 3 LIMIT 1
---
    def set_shoe
      @shoe = Shoe.find(params[:id])