app/controllers/comments_controller.rb

INSERT INTO `comments` (`comment`, `commentable_id`, `commentable_type`, `created_at`, `updated_at`, `user_id`) VALUES ('123', 6, 'Shoe', '2014-12-06 17:28:46', '2014-12-06 17:28:46', 1)
---
  def create
    @comment = Comment.new(comment_params)
    respond_to do |format|
      if @comment.save