app/controllers/shoes_controller.rb

SELECT `shoes`.* FROM `shoes`
---
  def index
    @shoes = Shoe.all

SELECT  `shoes`.* FROM `shoes`  WHERE `shoes`.`id` = 2 LIMIT 1
---
    def set_shoe
      @shoe = Shoe.find(params[:id])