app/views/shoes/show.html.erb

SELECT `users`.* FROM `users`
---
    <%= f.label :user_id %>
    <%= select(:comment, :user_id, options_from_collection_for_select(User.all, :id, :email)) %>